sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/**
 * @brief Blinky Sample Application main file.
 *
 * This file contains the source code for a sample server application using the LED Button service.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "low_power_pwm.h"
#include "bsp.h"
#include "ble_gap.h"
#include "nrf_delay.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_spi.h"
#include "nrf_drv_twi.h"
#include "ble_smss.h"
#include "ble_bas.h"
#include "ble_advertising.h"

#include "sms_pressure.h"
#include "sms_imu.h"

#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"

#define CENTRAL_LINK_COUNT              0										/**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1										/**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define SMS_VERSION_ID					0x0101									/**< SMS Version:	MSB --> device ID (01 -> sensors, 02 -> remote, 03 -> central)
																									LSB --> version.subversion (2E -> 2.15) */
#define SMS_RELEASE_ID					001																									

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE            GATT_MTU_SIZE_DEFAULT					/**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2	/**< Reply when unsupported features are requested. */

#define ADVERTISING_LED_PIN             BSP_BOARD_LED_0							/**< Is on when device is advertising. */
//#define CONNECTED_LED_PIN               BSP_BOARD_LED_1							/**< Is on when device has connected. */
#define SENDING_LED_PIN					BSP_BOARD_LED_1

//#define LEDBUTTON_LED_PIN               BSP_BOARD_LED_2							/**< LED to be toggled with the help of the LED Button Service. */
//#define LEDBUTTON_LED1_PIN_NO			BSP_BOARD_LED_3
#define LEDBUTTON_BUTTON1_PIN           BSP_BUTTON_0							/**< Button that will trigger the notification event with the LED Button Service */
#define LEDBUTTON_BUTTON2_PIN			BSP_BUTTON_1

#define DEVICE_NAME                     "SMS_sensors"                             /**< Name of device. Will be included in the advertising data. */
#define BOOTLOADER_RESET_3MIN			(0x15C75ABE)							/**<Command to reset device and keep the bootloader active for 3 minutes */
#define BOOTLOADER_DFU_START			(0xB1)

#define APP_ADV_INTERVAL                64										/**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      120
//#define APP_ADV_TIMEOUT_IN_SECONDS      BLE_GAP_ADV_TIMEOUT_LIMITED_MAX			/**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */

#define APP_TIMER_PRESCALER             0										/**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_MAX_TIMERS            10										/**< Maximum number of simultaneously created timers. */
#define APP_TIMER_OP_QUEUE_SIZE         8										/**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(15, UNIT_1_25_MS)			/**< Minimum acceptable connection interval (15 ms). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)			/**< Maximum acceptable connection interval (20 ms). */
#define SLAVE_LATENCY                   0										/**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(2000, UNIT_10_MS)			/**< Connection supervisory time-out (4 seconds). */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000, APP_TIMER_PRESCALER)	/**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)	/**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3										/**< Number of attempts before giving up the connection parameter negotiation. */

#define APP_GPIOTE_MAX_USERS            1										/**< Maximum number of users of the GPIOTE handler. */
#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(5, APP_TIMER_PRESCALER)	/**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define DEAD_BEEF                       0xDEADBEEF								/**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SMS_BUTTON_LONG_PRESS_MS		3000
#define SMS_BATGAUGE_SAMPLE_MS			1000
//#define SMS_ADVERTISE_BLINK_MS			500
//#define SMS_CONNECT_BLINK_MS			100
//#define SMS_GAP_TIMEOUT_BLINK_MS		40


#define SAMPLES_IN_BUFFER 				10

#define PWM_PERIOD_129HZ				250 // Duty cycle (PWM/off) = 50%
#define PWM_PERIOD_198HZ				200	// Duty cycle (PWM/off) = 45%
#define PWM_PERIOD_337HZ				150	// Duty cycle (PWM/off) = 39%
#define PWM_PERIOD_682HZ				100	// Duty cycle (PWM/off) = 32%
#define PWM_PERIOD_1057HZ				75	// Duty cycle (PWM/off) = 28%
#define SMS_PWM_PERIOD					PWM_PERIOD_129HZ
#define SMS_LED_ON_DUTY					(0.2 * SMS_PWM_PERIOD) // Duty cycle within PWM
#define SMS_LED_RUNNING_DUTY			2		// in %
#if(SMS_PWM_PERIOD == PWM_PERIOD_129HZ)
#define SMS_LED_BLINK_ULTRA_TICKS		6		// 100ms
#define SMS_LED_BLINK_FAST_TICKS		15		// 250ms
#define SMS_LED_BLINK_MEDIUM_TICKS		60		// 1s
#define SMS_LED_BLINK_SLOW_TICKS		240		// 4s
#elif(SMS_PWM_PERIOD == PWM_PERIOD_198HZ)
#define SMS_LED_BLINK_ULTRA_TICKS		9		// 100ms
#define SMS_LED_BLINK_FAST_TICKS		22		// 250ms
#define SMS_LED_BLINK_MEDIUM_TICKS		87		// 1s
#define SMS_LED_BLINK_SLOW_TICKS		348		// 4s
#elif(SMS_PWM_PERIOD == PWM_PERIOD_337HZ)
#define SMS_LED_BLINK_ULTRA_TICKS		12		// 100ms
#define SMS_LED_BLINK_FAST_TICKS		32		// 250ms
#define SMS_LED_BLINK_MEDIUM_TICKS		128		// 1s
#define SMS_LED_BLINK_SLOW_TICKS		512		// 4s
#elif(SMS_PWM_PERIOD == PWM_PERIOD_682HZ)
#define SMS_LED_BLINK_ULTRA_TICKS		21		// 100ms
#define SMS_LED_BLINK_FAST_TICKS		53		// 250ms
#define SMS_LED_BLINK_MEDIUM_TICKS		212		// 1s
#define SMS_LED_BLINK_SLOW_TICKS		848		// 4s
#elif(SMS_PWM_PERIOD == PWM_PERIOD_1057HZ)
#define SMS_LED_BLINK_ULTRA_TICKS		30		// 100ms
#define SMS_LED_BLINK_FAST_TICKS		74		// 250ms
#define SMS_LED_BLINK_MEDIUM_TICKS		294		// 1s
#define SMS_LED_BLINK_SLOW_TICKS		1176	// 4s
#endif

enum running_states {
	SMS_OFF,
	SMS_ADVERTISING,
	SMS_RUNNING
};

