sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

static void app_update_function(ble_smss_t * p_smss, uint8_t *data)
{
	uint32_t command = (data[0] +
						(data[1] << 8) +
						(data[2] << 16) +
						(data[3] << 24));
	NRF_LOG_INFO("Received app update command: %#x\n\r", command);
	if(command == 0x00) {
		NRF_LOG_INFO("Restarting device with 3 min bootloader...\n\r");
		bootloader_start(p_smss->conn_handle);
	}
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	uint32_t err_code;
	
	ble_smss_init_t init;
	init.app_update_function = app_update_function;
	ble_smss_init(&m_smss_service, &init);
	 
    ble_bas_init_t bas_init;

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

	// Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
//static void led_write_handler(ble_smss_t * p_smss, uint8_t led_state)
//{
//    if (led_state)
//    {
//        bsp_board_led_on(LEDBUTTON_LED_PIN);
//        NRF_LOG_INFO("Received LED ON!\r\n");
//    }
//    else
//    {
//        bsp_board_led_off(LEDBUTTON_LED_PIN);
//        NRF_LOG_INFO("Received LED OFF!\r\n");
//    }
//}
//static void led1_write_handler(ble_smss_t * p_smss, uint8_t led_state)
//{
//	if (led_state)
//	{
//		for(int i=0; i<10;i++)
//		{
//			nrf_gpio_pin_toggle(LEDBUTTON_LED1_PIN_NO);
//			nrf_delay_us(100000);
//		}
//	}
//	else
//	{
//		for(int i=0; i<24;i++)
//		{
//			nrf_gpio_pin_toggle(LEDBUTTON_LED1_PIN_NO);
//			nrf_delay_us(40000);
//		}
//	}
//}









/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t             err_code;
//    ble_gap_adv_params_t adv_params;

	NRF_LOG_INFO("Starting advertising for %d seconds\n\r", APP_ADV_TIMEOUT_IN_SECONDS);

	m_app_state.pwm[0] = PWM_ON;
	m_app_state.led[0] = LED_ADVERTISING;
	m_app_state.running = SMS_ADVERTISING;
//	err_code = low_power_pwm_duty_set(&low_power_pwm_0, SMS_LED_ON_DUTY);
//	APP_ERROR_CHECK(err_code);
	err_code = low_power_pwm_start((&low_power_pwm_0), low_power_pwm_0.bit_mask);
	APP_ERROR_CHECK(err_code);
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
	
	
//    // Start advertising
//    memset(&adv_params, 0, sizeof(adv_params));

//    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
//    adv_params.p_peer_addr = NULL;
//    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
//    adv_params.interval    = APP_ADV_INTERVAL;
//    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

//    err_code = sd_ble_gap_adv_start(&adv_params);
//    APP_ERROR_CHECK(err_code);
//    bsp_board_led_on(ADVERTISING_LED_PIN);
}


void batgauge_start(void)
{
	NRF_LOG_DEBUG("Starting saadc\n\r");
	nrf_drv_saadc_sample();
	
	NRF_LOG_DEBUG("Starting batgauge timer\n\r");
	app_timer_start(saadc_timer_id,
		APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BATGAUGE_SAMPLE_MS, UNIT_1_00_MS), 0),
		NULL);
	
