sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
			bno055_interrupt.new_value = false;
			imu_poll_data(SMS_IMU_DATAMSK_QUAT);
			NRF_LOG_DEBUG("Quat: %d %d %d %d\n\r",
						(int32_t)(bno055_output.quat[0].val * 1000000),
						(int32_t)(bno055_output.quat[1].val * 1000000),
						(int32_t)(bno055_output.quat[2].val * 1000000),
						(int32_t)(bno055_output.quat[3].val * 1000000));
//			bno055_interrupt.rts = true;
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
		
		if(m_app_state.batgauge.new_value)
		{
			m_app_state.batgauge.new_value = false;
			uint32_t err_code;
			err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)m_app_state.batgauge.bat_level);
			if ((err_code != NRF_SUCCESS) &&
				(err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
			   )
			{
				APP_ERROR_HANDLER(err_code);
			}
		}
		
		if((ms58_interrupt.enabled) && (ms58_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.rts = false;
			int32_t * tosend;
			tosend = &ms58_output.pressure;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_press_value(&m_smss_service, tosend);
			bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		if((bno055_interrupt.enabled) && (bno055_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);
			
			bno055_interrupt.rts = false;
			uint32_t * tosend;
			tosend = (uint32_t*)&bno055_output.quat[0].b;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_imu_value(&m_smss_service, tosend);
		    bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
	}
}


/**
 * @}
 */
